In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/029.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                      3                   4
0      NaN  NaN  NaN  Honeycutt (R)  45,770  Scott (D)  103,019
1      NaN  NaN  NaN                  30.8%               69.2%
2   County   PR   TP                    NaN                 NaN
3  CLAYTON   58   58                   9386               34783
4     COBB   68   68                  19566               30744

In [5]:
df = df[3:]

In [6]:
df.head(5)

         0   1   2      3      4
3  CLAYTON  58  58   9386  34783
4     COBB  68  68  19566  30744
5   DEKALB   9   9    240   4376
6  DOUGLAS  20  20   9180  10810
7   FULTON  27  27   2745  14774

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

         0      3      4
3  CLAYTON   9386  34783
4     COBB  19566  30744
5   DEKALB    240   4376
6  DOUGLAS   9180  10810
7   FULTON   2745  14774

In [9]:
df.columns = ['county', 'Deborah Travis Honeycutt', 'David Scott']

In [10]:
df.tail(5)

    county Deborah Travis Honeycutt David Scott
4     COBB                    19566       30744
5   DEKALB                      240        4376
6  DOUGLAS                     9180       10810
7   FULTON                     2745       14774
8    HENRY                     4653        7532

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

    county                 candidate  votes
0  CLAYTON  Deborah Travis Honeycutt   9386
1     COBB  Deborah Travis Honeycutt  19566
2   DEKALB  Deborah Travis Honeycutt    240
3  DOUGLAS  Deborah Travis Honeycutt   9180
4   FULTON  Deborah Travis Honeycutt   2745

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
county       12 non-null object
candidate    12 non-null object
votes        12 non-null int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '13'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Deborah Travis Honeycutt', 'party'] = 'Republican'
df.loc[df['candidate'] == 'David Scott', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate                 party
David Scott               Democrat      103019
Deborah Travis Honeycutt  Republican     45770
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,CLAYTON,U.S. Representative,13,Republican,Deborah Travis Honeycutt,9386
1,COBB,U.S. Representative,13,Republican,Deborah Travis Honeycutt,19566
2,DEKALB,U.S. Representative,13,Republican,Deborah Travis Honeycutt,240
3,DOUGLAS,U.S. Representative,13,Republican,Deborah Travis Honeycutt,9180
4,FULTON,U.S. Representative,13,Republican,Deborah Travis Honeycutt,2745

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')